---
kind: method
id: M:Autodesk.Revit.DB.Plumbing.PipePressureDropData.Dispose
source: html/922c86f7-859b-bc28-cb87-fe93fc15e459.htm
---
# Autodesk.Revit.DB.Plumbing.PipePressureDropData.Dispose Method

Releases all resources used by the PipePressureDropData

## Syntax (C#)
```csharp
public void Dispose()
```